Revit 2027 API
ParameterTypeId.MeasureTotalLength Property
 "Measure Total Length"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId MeasureTotalLength { get; }
Public Shared ReadOnly Property MeasureTotalLength As ForgeTypeId
	Get
public:
static property ForgeTypeId^ MeasureTotalLength {
	ForgeTypeId^ get ();
}
static member MeasureTotalLength : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace